import { defineExtension } from '@matane/extension-sdk';
import { GigaViewer, HIDE_LOCKED_PREFERENCE, HIDE_UNAVAILABLE_PREFERENCE } from './gigaviewer/GigaViewer';

class ComicDays extends GigaViewer {
  readonly name = 'Comic Days';
  readonly baseUrl = 'https://comic-days.com';

  override seriesListIds = [
    '13932016480029138639',
    '13932016480029138640',
    '13932016480029138641',
    '13932016480029138642',
    '13932016480029138643',
    '13932016480029138644',
    '13932016480029138645',
    '13932016480029255192',
  ];

  override filterOptions(): [string, string[]][] {
    return [
      ['連載作品一覧', this.seriesListIds],
      ['メディア化', ['Genre:3269754496379892693']],
      ['恋愛', ['Genre:3269754496379892700']],
      ['ラブコメ', ['Genre:3269754496379892701']],
      ['コメディ・ギャグ', ['Genre:3269754496379892706']],
      ['サスペンス', ['Genre:3269754496379892707']],
      ['アクション', ['Genre:3269754496379892708']],
      ['歴史・時代', ['Genre:3269754496379892709']],
      ['日常', ['Genre:3269754496379892710']],
      ['ヒューマンドラマ', ['Genre:3269754496379892711']],
      ['異世界・転生', ['Genre:3269754496379892712']],
      ['家族', ['Genre:3269754496379892713']],
      ['結婚・育児', ['Genre:3269754496379892714']],
      ['浮気・不倫', ['Genre:3269754496379892715']],
      ['ヤンキー・裏社会', ['Genre:3269754496379892716']],
      ['サバイバル', ['Genre:3269754496379892717']],
      ['お色気', ['Genre:3269754496379892720']],
      ['青春・スポーツ', ['Genre:3269754496379892723']],
      ['SF', ['Genre:3269754496379892724']],
      ['ショート・4コマ', ['Genre:3269754496379892725']],
      ['仕事', ['Genre:3269754496379892726']],
      ['医療', ['Genre:3269754496379892727']],
      ['教養・社会問題', ['Genre:3269754496379892728']],
      ['芸術', ['Genre:3269754496379892737']],
      ['グルメ', ['Genre:3269754496379892740']],
      ['軍事・警察', ['Genre:3269754496379892741']],
      ['実話・エッセイ', ['Genre:3269754496379892747']],
      ['動物・ねこ', ['Genre:3269754496379892748']],
      ['BL', ['Genre:3269754496379892749']],
      ['百合', ['Genre:3269754496379892750']],
      ['続編・スピンオフ', ['Genre:3269754496379892753']],
    ];
  }
}

export default defineExtension({
  preferences: () => [HIDE_LOCKED_PREFERENCE, HIDE_UNAVAILABLE_PREFERENCE],
  createSource: () => new ComicDays().toSource(),
});
